app/Controllers/Login.php

    public function masuk()
    {
        $post = $this->request->getPost();
        $query = $this->db->table('user')->getWhere(['username' => $post['username']]);
---
SELECT *
FROM `user`
WHERE `username` = 'admin'