app/Controllers/Order.php

SELECT *
FROM `order`
JOIN `user` ON `user`.`id_user` = `order`.`id_user`
WHERE `status_order` = 'belum di bayar '
---
    public function index()
    {
        $builder = $this->db->table('order');
        $builder->select('*');
        $builder->join('user', 'user.id_user = order.id_user');
        $builder->where('status_order', 'belum di bayar ');
        $query = $builder->get()->getResult();