app/Controllers/Transaksi.php

SELECT *
FROM `transaksi`
JOIN `user` ON `transaksi`.`id_user`=`user`.`id_user`
---
    public function index()
    {
        $builder = $this->db->table('transaksi');
        $builder->select('*');
        $builder->join('user', 'transaksi.id_user=user.id_user');
        $query = $builder->get()->getResult();

SELECT *
FROM `detail_order`
JOIN `masakan` ON `detail_order`.`id_menu`=`masakan`.`id_menu`
WHERE `id_order` = '14'
---
    public function tambah($id)
    {
        $builder = $this->db->table('detail_order');
        $builder->select('*');
        $builder->join('masakan', 'detail_order.id_menu=masakan.id_menu');
        $builder->where('id_order', $id);
        $query = $builder->get()->getResultArray();

INSERT INTO `transaksi` (`id_user`, `id_order`, `total_bayar`, `kembalian`, `tanggal`, `updated_at`) VALUES ('19', '14', '70000', 5000, '2022-03-29 03:15:57', '2022-03-29 03:15:57')
UPDATE `order` SET `status_order` = 'Selesai', `updated_at` = '2022-03-29 03:15:57'
WHERE `order`.`id_order` IN ('14')
---
    public function insert()
    {
        $id_order = $this->request->getVar('id_order');
        $bayar =  $this->request->getVar('total_bayar');
        $total = $this->request->getVar('total');

        $kembalian = $bayar - $total;

        $data = [
            'id_user' => $this->request->getVar('id_user'),
            'id_order' => $id_order,
            'total_bayar' => $bayar,
            'kembalian' => $kembalian
        ];

        if ($bayar < $total) {
            session()->setFlashData('pesan', '<div class="alert alert-success" role="alert">Uang nya kurang!</div>');
            return redirect()->back();
        }
        $insert = $this->transaksi->insert($data);

        if ($insert) {
            $status = [
                'id_order' => $id_order,
                'status_order' => 'Selesai'
            ];

            $this->order->save($status);