app/Models/DetailOrder.php

SELECT *
FROM `detail_order`
JOIN `masakan` ON `masakan`.`id_menu` = `detail_order`.`id_menu`
WHERE `id_order` = '14'
---
    public function getDetail($id)
    {
        $builder = $this->db->table('detail_order');
        $builder->select('*');
        $builder->join('masakan', 'masakan.id_menu = detail_order.id_menu');
        $builder->where('id_order', $id);
        $query = $builder->get()->getResult();