app/Models/MenuModel.php

SELECT COUNT(*) AS `numrows` FROM `masakan`
---
    public function jumlahMenu()
    {

        $query = $this->db->table('masakan')->countAll();