app/Models/TransaksiModel.php

SELECT COUNT(*) AS `numrows` FROM `transaksi`
---
    public function jumlahtransaksi()
    {

        $query = $this->db->table('transaksi')->countAll();