app/Models/UserModel.php

    public function dataUser()
    {
        $builder = $this->db->table('user');
        $builder->select('*');
        $builder->join('level', 'level.id_level = user.id_level');
        $query = $builder->get()->getResult();
---
SELECT *
FROM `user`
JOIN `level` ON `level`.`id_level` = `user`.`id_level`

    public function jumlahUser()
    {

        $query = $this->db->table('user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `user`